resources/help/parameters.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee3177a">1. Facts about buildings</a>
<ul>
<li><a href="#org3c3b325">1.1. Annual demand</a></li>
<li><a href="#org94ef07c">1.2. Peak demand</a></li>
<li><a href="#org30e3855">1.3. <span class="todo TODO">TODO</span> Building height</a></li>
<li><a href="#org333f922">1.4. <span class="todo TODO">TODO</span> Floor area</a></li>
<li><a href="#org43e301b">1.5. <span class="todo TODO">TODO</span> Benchmark terms</a></li>
<li><a href="#org3a7baa3">1.6. <span class="todo TODO">TODO</span> Peak to base ratio</a></li>
<li><a href="#org173db61">1.7. <span class="todo TODO">TODO</span> Heat price</a></li>
<li><a href="#org36f1d7e">1.8. <span class="todo TODO">TODO</span> Connection cost</a></li>
<li><a href="#org957920c">1.9. <span class="todo TODO">TODO</span> Emissions factors</a></li>
</ul>
</li>
<li><a href="#org6dabf1f">2. Facts about pipes</a>
<ul>
<li><a href="#orgc4976bf">2.1. <span class="todo TODO">TODO</span> Mechanical engineering costs</a></li>
<li><a href="#orgc3d81e4">2.2. <span class="todo TODO">TODO</span> Civil engineering costs</a></li>
<li><a href="#orgd2d926d">2.3. <span class="todo TODO">TODO</span> Flow, return, and ground temperatures</a></li>
</ul>
</li>
<li><a href="#org89c3138">3. Heat supply</a>
<ul>
<li><a href="#org0171188">3.1. <span class="todo TODO">TODO</span> Fixed capital cost</a></li>
<li><a href="#orgb3a159d">3.2. <span class="todo TODO">TODO</span> Capital cost for capacity</a></li>
<li><a href="#org172ea10">3.3. <span class="todo TODO">TODO</span> Operating cost for capacity</a></li>
<li><a href="#org5333357">3.4. <span class="todo TODO">TODO</span> Cost of producing heat</a></li>
<li><a href="#org9d44bbc">3.5. <span class="todo TODO">TODO</span> Maximum capacity</a></li>
<li><a href="#org261e296">3.6. <span class="todo TODO">TODO</span> Emissions factors</a></li>
</ul>
</li>
<li><a href="#org0f9db7e">4. Categorical information</a>
<ul>
<li><a href="#orge8d7571">4.1. <span class="todo TODO">TODO</span> Name / address</a></li>
<li><a href="#orgfa338f1">4.2. <span class="todo TODO">TODO</span> Classification</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This document contains a list of the important you can tell THERMOS, what they mean, and where you might get them. 
</p>

<div id="outline-container-orgee3177a" class="outline-2">
<h2 id="orgee3177a"><span class="section-number-2">1</span> Facts about buildings</h2>
<div class="outline-text-2" id="text-1">
<p>
These parameters are mostly used when creating a map (see <a href="maps.html">here</a> for more).
</p>
</div>

<div id="outline-container-org3c3b325" class="outline-3">
<h3 id="org3c3b325"><span class="section-number-3">1.1</span> Annual demand</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The annual demand for heat in a building, in kWh.
</p>

<p>
Every building in a map has a value associated with it for annual demand
The value is placed on the building when the map is created, either using a known user input, a benchmark estimate, or the THERMOS heat demand model.
</p>

<p>
You can edit this demand directly in a network problem by right clicking on a building and selecting <code>Edit buildings</code>. The edit will not change the map, only that problem.
</p>

<p>
This value affects:
</p>

<ul class="org-ul">
<li>the revenue for providing heat to the building</li>
<li>the avoided emissions by providing heat to the building</li>
<li>the cost of supplying heat into the network</li>
</ul>
</div>
</div>

<div id="outline-container-org94ef07c" class="outline-3">
<h3 id="org94ef07c"><span class="section-number-3">1.2</span> Peak demand</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The peak demand for heat in a building, in kW.
</p>

<p>
Every building in a map has a value associated with it for peak demand.
The value is placed on the building when the map is created, either using a known user input, a user input peak-to-base ratio, or the THERMOS heat demand model.
</p>

<p>
You can edit the peak directly in a network problem by right clicking on a building and selecting <code>Edit buildings</code>. The edit will not change the map, only that problem.
</p>

<p>
This value affects:
</p>

<ul class="org-ul">
<li>the size (and hence cost) of pipes needed to supply the building</li>
<li>the size (and hence cost) of the plant needed to supply the network</li>
<li>the connection costs for the building</li>
</ul>
</div>
</div>

<div id="outline-container-org30e3855" class="outline-3">
<h3 id="org30e3855"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Building height</h3>
</div>

<div id="outline-container-org333f922" class="outline-3">
<h3 id="org333f922"><span class="section-number-3">1.4</span> <span class="todo TODO">TODO</span> Floor area</h3>
</div>

<div id="outline-container-org43e301b" class="outline-3">
<h3 id="org43e301b"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> Benchmark terms</h3>
</div>

<div id="outline-container-org3a7baa3" class="outline-3">
<h3 id="org3a7baa3"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> Peak to base ratio</h3>
</div>

<div id="outline-container-org173db61" class="outline-3">
<h3 id="org173db61"><span class="section-number-3">1.7</span> <span class="todo TODO">TODO</span> Heat price</h3>
</div>

<div id="outline-container-org36f1d7e" class="outline-3">
<h3 id="org36f1d7e"><span class="section-number-3">1.8</span> <span class="todo TODO">TODO</span> Connection cost</h3>
</div>

<div id="outline-container-org957920c" class="outline-3">
<h3 id="org957920c"><span class="section-number-3">1.9</span> <span class="todo TODO">TODO</span> Emissions factors</h3>
</div>
</div>

<div id="outline-container-org6dabf1f" class="outline-2">
<h2 id="org6dabf1f"><span class="section-number-2">2</span> Facts about pipes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc4976bf" class="outline-3">
<h3 id="orgc4976bf"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Mechanical engineering costs</h3>
</div>

<div id="outline-container-orgc3d81e4" class="outline-3">
<h3 id="orgc3d81e4"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Civil engineering costs</h3>
</div>

<div id="outline-container-orgd2d926d" class="outline-3">
<h3 id="orgd2d926d"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Flow, return, and ground temperatures</h3>
</div>
</div>

<div id="outline-container-org89c3138" class="outline-2">
<h2 id="org89c3138"><span class="section-number-2">3</span> Heat supply</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0171188" class="outline-3">
<h3 id="org0171188"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> Fixed capital cost</h3>
</div>

<div id="outline-container-orgb3a159d" class="outline-3">
<h3 id="orgb3a159d"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Capital cost for capacity</h3>
</div>

<div id="outline-container-org172ea10" class="outline-3">
<h3 id="org172ea10"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Operating cost for capacity</h3>
</div>

<div id="outline-container-org5333357" class="outline-3">
<h3 id="org5333357"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> Cost of producing heat</h3>
</div>

<div id="outline-container-org9d44bbc" class="outline-3">
<h3 id="org9d44bbc"><span class="section-number-3">3.5</span> <span class="todo TODO">TODO</span> Maximum capacity</h3>
</div>

<div id="outline-container-org261e296" class="outline-3">
<h3 id="org261e296"><span class="section-number-3">3.6</span> <span class="todo TODO">TODO</span> Emissions factors</h3>
</div>
</div>

<div id="outline-container-org0f9db7e" class="outline-2">
<h2 id="org0f9db7e"><span class="section-number-2">4</span> Categorical information</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge8d7571" class="outline-3">
<h3 id="orge8d7571"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> Name / address</h3>
</div>

<div id="outline-container-orgfa338f1" class="outline-3">
<h3 id="orgfa338f1"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Classification</h3>
</div>
</div>
